1c-config/src/Catalogs/венд_МобильныеУстройства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>венд_МобильныеУстройства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<Attribute>
				<Properties>
					<Name>АвтоПроведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПривязки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешТокена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c-config/src/HTTPServices/венд_МобильноеПриложение/Ext/Module.bsl
// HTTP-сервіс "венд_МобильноеПриложение"
// REST API мобільного застосунку торгпреда (Vendo). Контракт сумісний із
// фронтендом: GET /products|categories|customers, GET/POST /orders,
// PUT/DELETE /orders/{num}, POST /auth.
//
// Усі дані фільтруються за МОБІЛЬНИМ ПРИСТРОЄМ
// (Справочник.венд_МобильныеУстройства). Ідентифікатор пристрою передається
// в заголовку "X-Device-Id" або в параметрі запиту ?device=<GUID>.
// Пристрій задає: склад (залишки), тип цін, менеджера, перелік контрагентів і товарів.
//
// УВАГА: створення ЗаказПокупателя використовує реквізити, специфічні для
// "Управління торгівлею для України". Поля, позначені // TODO, треба вивірити
// на бойовій базі (організація за умовчанням, договір взаєморозрахунків, валюта).
//
// Статусна модель: "Нове" — лише локальне (невідправлене) на клієнті, у 1С не існує;
// непроведений документ у базі → "Відправлено"; проведений → "Проведено"; з помітками
// на видалення → "Видалено". Проведення залежить від статусу в тілі запиту (див.
// ЗаписатьЗаказ/НужноПровести). Якщо проведення не проходить на бойовій (контроль
// залишків, незаповнені обов'язкові поля) — POST/PUT повертає 400 з описом помилки.

#Область ОбработчикиМетодов

// POST /auth — { deviceId, pairingCode } -> обмін одноразового коду прив'язки
// на bearer-токен. Токен у базі не зберігається — лише його SHA-256; повертається
// клієнту один раз. Код прив'язки після успіху гаситься (повторне використання
// неможливе). Заблокований пристрій не авторизується.
Функция AuthPost(Запрос) Экспорт
	Попытка
	Тело = ПрочитатьТелоJSON(Запрос);
	ИдУстройства = "";
	КодПривязки = "";
	Если ТипЗнч(Тело) = Тип("Соответствие") Тогда
		Если Тело.Получить("deviceId") <> Неопределено Тогда
			ИдУстройства = СокрЛП(Строка(Тело.Получить("deviceId")));
		КонецЕсли;
		Если Тело.Получить("pairingCode") <> Неопределено Тогда
			КодПривязки = СокрЛП(Строка(Тело.Получить("pairingCode")));
		КонецЕсли;
	КонецЕсли;
	Если ПустаяСтрока(ИдУстройства) Тогда
		ИдУстройства = ИдентификаторУстройстваИзЗапроса(Запрос);
	КонецЕсли;

	Устройство = НайтиУстройство(ИдУстройства);
	Если Устройство = Неопределено Тогда
		Сообщ = НСтр("uk='Пристрій не зареєстровано'; ru='Устройство не зарегистрировано'; en='Device is not registered'",
			КодЯзыкаЗапроса(Запрос));
		Возврат ОтветJSON(Новый Структура("success, message", Ложь, Сообщ), 401);
	КонецЕсли;
	Если Устройство.Заблокировано Тогда
		Сообщ = НСтр("uk='Пристрій заблоковано'; ru='Устройство заблокировано'; en='Device is blocked'",
			КодЯзыкаЗапроса(Запрос));
		Возврат ОтветJSON(Новый Структура("success, message", Ложь, Сообщ), 401);
	КонецЕсли;
	// Код прив'язки має бути заданий у картці пристрою і збігатися (звіряємо без врахування регістру).
	Если ПустаяСтрока(КодПривязки) Или ПустаяСтрока(Устройство.КодПривязки)
		Или НРег(КодПривязки) <> НРег(СокрЛП(Устройство.КодПривязки)) Тогда
		Сообщ = НСтр("uk='Невірний або використаний код прив''язки'; ru='Неверный или использованный код привязки'; en='Invalid or already used pairing code'",
			КодЯзыкаЗапроса(Запрос));
		Возврат ОтветJSON(Новый Структура("success, message", Ложь, Сообщ), 401);
	КонецЕсли;

	Токен = НовыйТокен();
	ОбъектУстройства = Устройство.ПолучитьОбъект();
	ОбъектУстройства.ХешТокена = ХешТокенаСтрокой(Токен);
	ОбъектУстройства.КодПривязки = ""; // одноразовий — гасимо після видачі токена
	ОбъектУстройства.Записать();

	Пользователь = Новый Структура("name, role", Строка(Устройство.Менеджер), "sales_rep");
	Возврат ОтветJSON(Новый Структура("success, user, token", Истина, Пользователь, Токен));
	Исключение
		Возврат ОтветИсключение(Запрос, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

// GET /products — номенклатура пристрою з ціною (за типом цін) і залишком (за складом).
Функция ProductsGet(Запрос) Экспорт
	Попытка
	Устройство = ОпределитьУстройство(Запрос);
	Если Устройство = Неопределено Тогда Возврат ОтветНеАвторизован(Запрос); КонецЕсли;
	Возврат ОтветJSON(ТоварыУстройства(Устройство));
	Исключение
		Возврат ОтветИсключение(Запрос, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

// GET /products/{id}/image — основне зображення номенклатури (бінарно).
// Джерело: Справочник.Номенклатура.ОсновноеИзображение (тип
// Справочник.ХранилищеДополнительнойИнформации), байти — у реквізиті "Хранилище"
// (ХранилищеЗначения). Content-Type визначається за розширенням ИмяФайла. 404 — якщо
// товару/зображення немає. Захищено так само, як решта (X-Device-Id + bearer-токен),
// тож застосунок тягне картинку через fetch із заголовками, а не голим <img src>.
Функция ProductImageGet(Запрос) Экспорт
	Попытка
	Устройство = ОпределитьУстройство(Запрос);
	Если Устройство = Неопределено Тогда Возврат ОтветНеАвторизован(Запрос); КонецЕсли;

	СсылкаТовара = СсылкаНоменклатуры(Запрос.ПараметрыURL.Получить("id"));
	Если СсылкаТовара = Неопределено Тогда Возврат ОтветБезТела(404); КонецЕсли;

	ЭлементХранилища = СсылкаТовара.ОсновноеИзображение;
	Если НЕ ЗначениеЗаполнено(ЭлементХранилища) Тогда Возврат ОтветБезТела(404); КонецЕсли;

	// У цій УТ байти зберігаються у реквізиті "Хранилище" (ХранилищеЗначения) як об'єкт
	// Картинка (звірено на бойовій). Дістаємо ДвоичныеДанные й MIME беремо з формату
	// картинки (ИмяФайла порожнє). Підстраховуємось і на випадок прямих ДвоичныхДанных.
	Содержимое = ЭлементХранилища.Хранилище;
	Если ТипЗнч(Содержимое) = Тип("ХранилищеЗначения") Тогда
		Содержимое = Содержимое.Получить();
	КонецЕсли;

	ТипКонтента = "application/octet-stream";
	ДвоичныеДанные = Неопределено;
	Если ТипЗнч(Содержимое) = Тип("Картинка") Тогда
		ДвоичныеДанные = Содержимое.ПолучитьДвоичныеДанные();
		ТипКонтента = MIMEПоФорматуКартинки(Содержимое.Формат());
	ИначеЕсли ТипЗнч(Содержимое) = Тип("ДвоичныеДанные") Тогда
		ДвоичныеДанные = Содержимое;
		ТипКонтента = MIMEПоИмениФайла(Строка(ЭлементХранилища.ИмяФайла));
	КонецЕсли;
	Если ДвоичныеДанные = Неопределено Тогда Возврат ОтветБезТела(404); КонецЕсли;

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);
	Ответ.Заголовки.Вставить("Content-Type", ТипКонтента);
	Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", "*");
	Ответ.Заголовки.Вставить("Cache-Control", "public, max-age=86400");
	Возврат Ответ;
	Исключение
		Возврат ОтветИсключение(Запрос, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

// GET /categories — групи номенклатури пристрою.
Функция CategoriesGet(Запрос) Экспорт
	Попытка
	Устройство = ОпределитьУстройство(Запрос);
	Если Устройство = Неопределено Тогда Возврат ОтветНеАвторизован(Запрос); КонецЕсли;
	Возврат ОтветJSON(КатегорииУстройства(Устройство));
	Исключение
		Возврат ОтветИсключение(Запрос, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

// GET /customers — контрагенти пристрою з поточним боргом.
Функция CustomersGet(Запрос) Экспорт
	Попытка
	Устройство = ОпределитьУстройство(Запрос);
	Если Устройство = Неопределено Тогда Возврат ОтветНеАвторизован(Запрос); КонецЕсли;
	Возврат ОтветJSON(КонтрагентыУстройства(Устройство));
	Исключение
		Возврат ОтветИсключение(Запрос, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

// GET /orders?startDate=&endDate= — замовлення менеджера пристрою за період.
Функция OrdersGet(Запрос) Экспорт
	Попытка
	Устройство = ОпределитьУстройство(Запрос);
	Если Устройство = Неопределено Тогда Возврат ОтветНеАвторизован(Запрос); КонецЕсли;

	Параметры = Запрос.ПараметрыЗапроса;
	НачалоПериода = ?(Параметры.Получить("startDate") = Неопределено, "", Параметры.Получить("startDate"));
	КонецПериода   = ?(Параметры.Получить("endDate")   = Неопределено, "", Параметры.Получить("endDate"));

	Возврат ОтветJSON(ЗаказыУстройства(Устройство, НачалоПериода, КонецПериода));
	Исключение
		Возврат ОтветИсключение(Запрос, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

// POST /orders — upsert ЗаказПокупателя за клієнтським GUID (id). Якщо документ із
// таким id уже існує — оновлюємо (з перевіркою конфлікту за version); інакше створюємо
// новий, присвоївши йому посилання = клієнтський GUID. Так офлайн-черга ідемпотентна,
// а ідентичність збігається з 1С (#6).
Функция OrdersPost(Запрос) Экспорт
	Попытка
	Устройство = ОпределитьУстройство(Запрос);
	Если Устройство = Неопределено Тогда Возврат ОтветНеАвторизован(Запрос); КонецЕсли;

	Тело = ПрочитатьТелоJSON(Запрос);
	Если ТипЗнч(Тело) <> Тип("Соответствие") Тогда
		Сообщ = НСтр("uk='Некоректне тіло запиту'; ru='Некорректное тело запроса'; en='Invalid request body'",
			КодЯзыкаЗапроса(Запрос));
		Возврат ОтветJSON(Новый Структура("success, message", Ложь, Сообщ), 400);
	КонецЕсли;

	Ид = Тело.Получить("id");
	СсылкаСущ = ?(ЗначениеЗаполнено(Ид), НайтиЗаказПоИд(Ид), Неопределено);

	Если СсылкаСущ <> Неопределено Тогда
		// Існує → оновлення з перевіркою конфлікту (оптимістична конкуренція за ВерсияДанных).
		БазоваяВерсия = Тело.Получить("baseVersion");
		Если БазоваяВерсия <> Неопределено И Строка(СсылкаСущ.ВерсияДанных) <> Строка(БазоваяВерсия) Тогда
			Сообщ = НСтр("uk='Замовлення змінили на сервері після ваших правок'; ru='Заказ изменили на сервере после ваших правок'; en='Order changed on server after your edits'",
				КодЯзыкаЗапроса(Запрос));
			Возврат ОтветJSON(Новый Структура("success, conflict, message, order", Ложь, Истина, Сообщ, ГидратироватьЗаказ(СсылкаСущ)), 409);
		КонецЕсли;
		Попытка
			ОбновитьЗаказ(СсылкаСущ, Устройство, Тело);
		Исключение
			Возврат ОтветJSON(Новый Структура("success, message", Ложь, ОписаниеОшибки()), 400);
		КонецПопытки;
		Возврат ОтветJSON(Новый Структура("success, order", Истина, ГидратироватьЗаказ(СсылкаСущ)));
	КонецЕсли;

	Попытка
		СсылкаЗаказа = СоздатьЗаказ(Устройство, Тело);
	Исключение
		Возврат ОтветJSON(Новый Структура("success, message", Ложь, ОписаниеОшибки()), 400);
	КонецПопытки;

	Возврат ОтветJSON(Новый Структура("success, order", Истина, ГидратироватьЗаказ(СсылкаЗаказа)));
	Исключение
		Возврат ОтветИсключение(Запрос, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

// PUT /orders/{id} — оновити склад/статус замовлення.
Функция OrderPut(Запрос) Экспорт
	Попытка
	Устройство = ОпределитьУстройство(Запрос);
	Если Устройство = Неопределено Тогда Возврат ОтветНеАвторизован(Запрос); КонецЕсли;

	СсылкаЗаказа = НайтиЗаказПоИд(Запрос.ПараметрыURL.Получить("id"));
	Если СсылкаЗаказа = Неопределено Тогда
		Сообщ = НСтр("uk='Замовлення не знайдено'; ru='Заказ не найден'; en='Order not found'",
			КодЯзыкаЗапроса(Запрос));
		Возврат ОтветJSON(Новый Структура("success, message", Ложь, Сообщ), 404);
	КонецЕсли;

	Тело = ПрочитатьТелоJSON(Запрос);

	// Виявлення конфлікту (оптимістична конкуренція) через типове поле ВерсияДанных:
	// клієнт надсилає baseVersion (версію, від якої редагував); якщо документ відтоді
	// змінили — не перезаписуємо мовчки, повертаємо 409 і поточну серверну версію.
	// Відсутній baseVersion = свідомий перезапис.
	БазоваяВерсия = ?(ТипЗнч(Тело) = Тип("Соответствие"), Тело.Получить("baseVersion"), Неопределено);
	Если БазоваяВерсия <> Неопределено И Строка(СсылкаЗаказа.ВерсияДанных) <> Строка(БазоваяВерсия) Тогда
		Сообщ = НСтр("uk='Замовлення змінили на сервері після ваших правок'; ru='Заказ изменили на сервере после ваших правок'; en='Order changed on server after your edits'",
			КодЯзыкаЗапроса(Запрос));
		Возврат ОтветJSON(Новый Структура("success, conflict, message, order", Ложь, Истина, Сообщ, ГидратироватьЗаказ(СсылкаЗаказа)), 409);
	КонецЕсли;

	Попытка
		ОбновитьЗаказ(СсылкаЗаказа, Устройство, Тело);
	Исключение
		Возврат ОтветJSON(Новый Структура("success, message", Ложь, ОписаниеОшибки()), 400);
	КонецПопытки;

	Возврат ОтветJSON(Новый Структура("success, order", Истина, ГидратироватьЗаказ(СсылкаЗаказа)));
	Исключение
		Возврат ОтветИсключение(Запрос, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

// DELETE /orders/{id} — видалити замовлення.
Функция OrderDelete(Запрос) Экспорт
	Попытка
	Устройство = ОпределитьУстройство(Запрос);
	Если Устройство = Неопределено Тогда Возврат ОтветНеАвторизован(Запрос); КонецЕсли;

	СсылкаЗаказа = НайтиЗаказПоИд(Запрос.ПараметрыURL.Получить("id"));
	Если СсылкаЗаказа = Неопределено Тогда
		Сообщ = НСтр("uk='Замовлення не знайдено'; ru='Заказ не найден'; en='Order not found'",
			КодЯзыкаЗапроса(Запрос));
		Возврат ОтветJSON(Новый Структура("success, message", Ложь, Сообщ), 404);
	КонецЕсли;

	ОбъектЗаказа = СсылкаЗаказа.ПолучитьОбъект();

	// Проведене замовлення з додатку не чіпаємо: його спершу розпроводять у 1С.
	Если ОбъектЗаказа.Проведен Тогда
		Сообщ = НСтр("uk='Проведене замовлення не можна видалити'; ru='Проведённый заказ нельзя удалить'; en='A posted order cannot be deleted'",
			КодЯзыкаЗапроса(Запрос));
		Возврат ОтветJSON(Новый Структура("success, message", Ложь, Сообщ), 409);
	КонецЕсли;

	// Непроведене (на клієнті — "Відправлено") помічаємо на видалення (механізм 1С).
	// "Нове" (локальне невідправлене) у 1С не існує, тож фізичного видалення тут немає.
	ОбъектЗаказа.УстановитьПометкуУдаления(Истина);
	Сообщ = НСтр("uk='Помічено на видалення'; ru='Помечено на удаление'; en='Marked for deletion'",
		КодЯзыкаЗапроса(Запрос));
	Возврат ОтветJSON(Новый Структура("success, marked, message, order", Истина, Истина, Сообщ, ГидратироватьЗаказ(СсылкаЗаказа)));
	Исключение
		Возврат ОтветИсключение(Запрос, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

#КонецОбласти

#Область Устройство

Функция ИдентификаторУстройстваИзЗапроса(Запрос)
	Идентификатор = Запрос.Заголовки.Получить("X-Device-Id");
	Если ПустаяСтрока(Идентификатор) Тогда
		Идентификатор = Запрос.ПараметрыЗапроса.Получить("device");
	КонецЕсли;
	Возврат ?(Идентификатор = Неопределено, "", СокрЛП(Идентификатор));
КонецФункции

Функция НайтиУстройство(Идентификатор)
	Если ПустаяСтрока(Идентификатор) Тогда Возврат Неопределено; КонецЕсли;
	Отбор = Справочники.венд_МобильныеУстройства.НайтиПоРеквизиту("ИдентификаторУстройства", Идентификатор);
	Возврат ?(ЗначениеЗаполнено(Отбор), Отбор, Неопределено);
КонецФункции

// Визначає пристрій ЛИШЕ за дійсним bearer-токеном: пристрій знайдено за
// X-Device-Id, не заблоковано, спарено (є хеш токена) і SHA-256 пред'явленого
// токена збігається зі збереженим. Інакше — Неопределено (запит відхиляється).
Функция ОпределитьУстройство(Запрос)
	Устройство = НайтиУстройство(ИдентификаторУстройстваИзЗапроса(Запрос));
	Если Устройство = Неопределено Тогда Возврат Неопределено; КонецЕсли;
	Если Устройство.Заблокировано Тогда Возврат Неопределено; КонецЕсли;

	Токен = ТокенИзЗапроса(Запрос);
	Если ПустаяСтрока(Токен) Или ПустаяСтрока(Устройство.ХешТокена) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ХешТокенаСтрокой(Токен) <> СокрЛП(Устройство.ХешТокена) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Устройство;
КонецФункции

// Токен застосунку з заголовка X-Auth-Token (основний) або Authorization (фолбек).
// ВАЖЛИВО: заголовок "Authorization" платформа 1С перехоплює для автентифікації до ІБ
// (Bearer там → "недійсний підпис"/401 ще до обробника), тому власний токен носимо в
// X-Auth-Token. Authorization лишаємо як запасний (демо-бекенд, де конфлікту немає).
Функция ТокенИзЗапроса(Запрос)
	Значение = Запрос.Заголовки.Получить("X-Auth-Token");
	Если Значение = Неопределено Тогда
		Значение = Запрос.Заголовки.Получить("Authorization");
	КонецЕсли;
	Если Значение = Неопределено Тогда Возврат ""; КонецЕсли;
	Значение = СокрЛП(Строка(Значение));
	Если НРег(Лев(Значение, 7)) = "bearer " Тогда
		Возврат СокрЛП(Сред(Значение, 8));
	КонецЕсли;
	Возврат Значение;
КонецФункции

// Новий секретний токен: два GUID без дефісів (~256 біт ентропії).
Функция НовыйТокен()
	Возврат СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "")
		+ СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
КонецФункции

// SHA-256(токен) у base64. У базі зберігається лише цей хеш, не сам токен.
Функция ХешТокенаСтрокой(Токен)
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить(ПолучитьДвоичныеДанныеИзСтроки(Токен));
	Возврат СокрЛП(Base64Строка(Хеширование.ХешСумма));
КонецФункции

#КонецОбласти

#Область Данные

Функция ТоварыУстройства(Устройство)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Устройство", Устройство);
	Запрос.УстановитьПараметр("Склад", Устройство.Склад);
	Запрос.УстановитьПараметр("ТипЦен", Устройство.ТипЦен);
	Запрос.Текст =
	// Крок 1. Вибір із ТЧ — узагальнені посилання (можуть бути ЕЛЕМЕНТАМИ, ГРУПАМИ,
	// ПІДГРУПАМИ). Типізація в запиті НЕ потрібна: узагальнений тип задано лише в
	// реквізиті метаданих (щоб не ламалося створення CF), а значення конкретні.
	// Крок 2. В ИЕРАРХИИ розгортає групи/підгрупи в листові елементи;
	// вибірка йде ИЗ самого довідника, тож кожна номенклатура — один раз
	// (РАЗЛИЧНЫЕ страхує від перетину груп і елементів у виборі).
	// Кроки 3-5. Регістри попередньо ЗГОРНУТО по номенклатурі (без вимірів
	// характеристика/упаковка/якість), щоб фінальні з'єднання були 1:1 і в
	// підсумковому масиві НЕ БУЛО ПОВТОРІВ номенклатури (інакше два LEFT JOIN з
	// багаторядковими віртуальними таблицями дають декартове розмноження).
	"ВЫБРАТЬ Товары.Номенклатура КАК Элемент ПОМЕСТИТЬ ВТ_Выбор
	|ИЗ Справочник.венд_МобильныеУстройства.Товары КАК Товары
	|ГДЕ Товары.Ссылка = &Устройство
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ Ном.Ссылка КАК Номенклатура ПОМЕСТИТЬ ВТ_Товары
	|ИЗ Справочник.Номенклатура КАК Ном
	|ГДЕ Ном.Ссылка В ИЕРАРХИИ (ВЫБРАТЬ ВТ_Выбор.Элемент ИЗ ВТ_Выбор КАК ВТ_Выбор) И НЕ Ном.ЭтоГруппа
	|;
	|ВЫБРАТЬ Цены.Номенклатура КАК Номенклатура, МАКСИМУМ(Цены.Цена) КАК Цена ПОМЕСТИТЬ ВТ_Цены
	|ИЗ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен = &ТипЦен И Номенклатура В (ВЫБРАТЬ ВТ.Номенклатура ИЗ ВТ_Товары КАК ВТ)) КАК Цены
	|СГРУППИРОВАТЬ ПО Цены.Номенклатура
	|;
	|ВЫБРАТЬ Ост.Номенклатура КАК Номенклатура, СУММА(Ост.КоличествоОстаток) КАК Кол ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад И Номенклатура В (ВЫБРАТЬ ВТ.Номенклатура ИЗ ВТ_Товары КАК ВТ)) КАК Ост
	|СГРУППИРОВАТЬ ПО Ост.Номенклатура
	|;
	|ВЫБРАТЬ Рез.Номенклатура КАК Номенклатура, СУММА(Рез.КоличествоОстаток) КАК Кол ПОМЕСТИТЬ ВТ_Резерв
	|ИЗ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад И Номенклатура В (ВЫБРАТЬ ВТ.Номенклатура ИЗ ВТ_Товары КАК ВТ)) КАК Рез
	|СГРУППИРОВАТЬ ПО Рез.Номенклатура
	|;
	|ВЫБРАТЬ ШК.Владелец КАК Номенклатура,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ШК.Штрихкод КАК СТРОКА(50))) КАК Штрихкод
	|ПОМЕСТИТЬ ВТ_Штрихкоды
	|ИЗ РегистрСведений.Штрихкоды КАК ШК
	|ГДЕ ШК.Владелец В (ВЫБРАТЬ ВТ.Номенклатура ИЗ ВТ_Товары КАК ВТ)
	|СГРУППИРОВАТЬ ПО ШК.Владелец
	|;
	|ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Ссылка,
	|	ВТ.Номенклатура.Наименование КАК Наименование,
	|	ВТ.Номенклатура.Артикул КАК Артикул,
	|	ВТ.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК Единица,
	|	ВТ.Номенклатура.Родитель.Наименование КАК Категория,
	|	ВТ.Номенклатура.Родитель КАК РодительСсылка,
	|	ЕСТЬNULL(Цены.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(Остатки.Кол, 0) - ЕСТЬNULL(Резерв.Кол, 0) КАК Остаток,
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	ВТ.Номенклатура.ОсновноеИзображение КАК ОсновноеИзображение
	|ИЗ
	|	ВТ_Товары КАК ВТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК Цены ПО Цены.Номенклатура = ВТ.Номенклатура
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК Остатки ПО Остатки.Номенклатура = ВТ.Номенклатура
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Резерв КАК Резерв ПО Резерв.Номенклатура = ВТ.Номенклатура
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Штрихкоды КАК Штрихкоды ПО Штрихкоды.Номенклатура = ВТ.Номенклатура";

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Товар = Новый Структура;
		Товар.Вставить("id", ИдСсылки(Выборка.Ссылка));
		Товар.Вставить("name", Выборка.Наименование);
		Товар.Вставить("sku", Выборка.Артикул);
		// Штрихкод із РегистрСведений.Штрихкоды (вимір Владелец=Номенклатура, Штрихкод=значення).
		ШК = Выборка.Штрихкод;
		Товар.Вставить("barcode", ?(ШК = Null, "", СокрЛП(Строка(ШК))));
		Товар.Вставить("price", Выборка.Цена);
		Товар.Вставить("stock", Выборка.Остаток);
		Товар.Вставить("unit", Выборка.Единица);
		Товар.Вставить("category", Выборка.Категория);
		Товар.Вставить("categoryId", ИдСсылки(Выборка.РодительСсылка)); // прив'язка до вузла дерева
		// img — відносний шлях бінарного ендпоінта зображення, якщо в номенклатури задано
		// ОсновноеИзображение; інакше "". Застосунок підвантажує через fetchProductImage
		// (ендпоінт захищений, тож не голий <img src>). До шляху додаємо ?v=<версія> на основі
		// ВерсияДанных елемента зображення — це cache-buster: змінилось фото → змінився v →
		// клієнт перекешовує (інакше показував би старе з офлайн-кешу).
		Изобр = Выборка.ОсновноеИзображение;
		Если ЗначениеЗаполнено(Изобр) Тогда
			Верс = "";
			Попытка
				Верс = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(Изобр.ВерсияДанных), "+", "-"), "/", "_"), "=", "");
			Исключение
			КонецПопытки;
			Путь = "/products/" + ИдСсылки(Выборка.Ссылка) + "/image";
			Если НЕ ПустаяСтрока(Верс) Тогда Путь = Путь + "?v=" + Верс; КонецЕсли;
			Товар.Вставить("img", Путь);
		Иначе
			Товар.Вставить("img", "");
		КонецЕсли;
		Результат.Добавить(Товар);
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Повертає ПОВНУ ієрархію груп номенклатури пристрою (довільна вкладеність).
// Кожна група несе parentId (посилання на батька, "" для кореня), щоб фронтенд
// будував дерево будь-якої глибини (drill-down, ROADMAP #31).
// count — кількість доступних товарів БЕЗПОСЕРЕДНЬО в групі; у проміжних груп
// він 0, але вони присутні як вузли шляху до кореня.
Функция КатегорииУстройства(Устройство)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Устройство", Устройство);
	// Безпосередні групи доступних товарів + лічильник прямих товарів.
	Запрос.Текст =
	"ВЫБРАТЬ Товары.Номенклатура КАК Элемент ПОМЕСТИТЬ ВТ_Выбор
	|ИЗ Справочник.венд_МобильныеУстройства.Товары КАК Товары
	|ГДЕ Товары.Ссылка = &Устройство
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ Ном.Ссылка КАК Номенклатура, Ном.Родитель КАК Родитель ПОМЕСТИТЬ ВТ_Товары
	|ИЗ Справочник.Номенклатура КАК Ном
	|ГДЕ Ном.Ссылка В ИЕРАРХИИ (ВЫБРАТЬ ВТ_Выбор.Элемент ИЗ ВТ_Выбор КАК ВТ_Выбор) И НЕ Ном.ЭтоГруппа
	|;
	|ВЫБРАТЬ ВТ.Родитель КАК Группа, КОЛИЧЕСТВО(ВТ.Номенклатура) КАК Кол
	|ИЗ ВТ_Товары КАК ВТ
	|ГДЕ ВТ.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО ВТ.Родитель";

	// ВсеГруппы: Ссылка(група) -> Структура("Имя, Родитель, Кол")
	ВсеГруппы = Новый Соответствие;
	КОбработке = Новый Массив; // групи, чиї Имя/Родитель ще не отримано
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВсеГруппы.Вставить(Выборка.Группа, Новый Структура("Имя, Родитель, Кол", "", Неопределено, Выборка.Кол));
		КОбработке.Добавить(Выборка.Группа);
	КонецЦикла;

	// Підйом угору по ієрархії: добираємо всі групи-предки (довільна глибина).
	Барьер = 0;
	Пока КОбработке.Количество() > 0 И Барьер < 50 Цикл
		Барьер = Барьер + 1;
		ЗапросГр = Новый Запрос(
			"ВЫБРАТЬ Гр.Ссылка КАК Ссылка, Гр.Наименование КАК Имя, Гр.Родитель КАК Родитель
			|ИЗ Справочник.Номенклатура КАК Гр
			|ГДЕ Гр.Ссылка В (&Список)");
		ЗапросГр.УстановитьПараметр("Список", КОбработке);
		КОбработке = Новый Массив;
		ВыбГр = ЗапросГр.Выполнить().Выбрать();
		Пока ВыбГр.Следующий() Цикл
			Инфо = ВсеГруппы.Получить(ВыбГр.Ссылка);
			Если Инфо = Неопределено Тогда
				Инфо = Новый Структура("Имя, Родитель, Кол", "", Неопределено, 0);
				ВсеГруппы.Вставить(ВыбГр.Ссылка, Инфо);
			КонецЕсли;
			Инфо.Имя = ВыбГр.Имя;
			Инфо.Родитель = ВыбГр.Родитель;
			Если ЗначениеЗаполнено(ВыбГр.Родитель) И ВсеГруппы.Получить(ВыбГр.Родитель) = Неопределено Тогда
				ВсеГруппы.Вставить(ВыбГр.Родитель, Новый Структура("Имя, Родитель, Кол", "", Неопределено, 0));
				КОбработке.Добавить(ВыбГр.Родитель);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Результат = Новый Массив;
	Для Каждого КЗ Из ВсеГруппы Цикл
		Инфо = КЗ.Значение;
		Категория = Новый Структура;
		Категория.Вставить("id", ИдСсылки(КЗ.Ключ));
		Категория.Вставить("name", ?(ПустаяСтрока(Инфо.Имя), Строка(КЗ.Ключ), Инфо.Имя));
		Категория.Вставить("parentId", ИдСсылки(Инфо.Родитель)); // "" => коренева група
		Категория.Вставить("icon", "");
		Категория.Вставить("count", Инфо.Кол);
		Категория.Вставить("expanded", Ложь);
		Результат.Добавить(Категория);
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция КонтрагентыУстройства(Устройство)
	// Спільний менеджер ВТ: основний запит будує ВТ_Контр, який повторно
	// використовує запит контактних осіб (#11).
	МВТ = Новый МенеджерВременныхТаблиц;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Устройство", Устройство);
	Запрос.Текст =
	// Контрагент у ТЧ — узагальнене посилання, може бути ЕЛЕМЕНТОМ або ГРУПОЮ.
	// В ИЕРАРХИИ розгортає групи в листових контрагентів; типізація в запиті
	// не потрібна (узагальнений тип — лише в реквізиті метаданих, значення конкретні).
	// Адреса й телефон контрагента — з регістру КонтактнаяИнформация (за Тип = Адрес/
	// Телефон), Представление — необмежений рядок, тож кастуємо ВЫРАЗИТЬ(… КАК СТРОКА(n))
	// для агрегації. Ім'я контактної особи — з реквізиту ОсновноеКонтактноеЛицо.
	"ВЫБРАТЬ Контрагенты.Контрагент КАК Элемент ПОМЕСТИТЬ ВТ_Выбор
	|ИЗ Справочник.венд_МобильныеУстройства.Контрагенты КАК Контрагенты
	|ГДЕ Контрагенты.Ссылка = &Устройство
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ Контр.Ссылка КАК Контрагент ПОМЕСТИТЬ ВТ_Контр
	|ИЗ Справочник.Контрагенты КАК Контр
	|ГДЕ Контр.Ссылка В ИЕРАРХИИ (ВЫБРАТЬ ВТ_Выбор.Элемент ИЗ ВТ_Выбор КАК ВТ_Выбор) И НЕ Контр.ЭтоГруппа
	|;
	|ВЫБРАТЬ Расч.Контрагент КАК Контрагент, СУММА(Расч.СуммаУпрОстаток) КАК Долг ПОМЕСТИТЬ ВТ_Долги
	|ИЗ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(, Контрагент В (ВЫБРАТЬ ВТ.Контрагент ИЗ ВТ_Контр КАК ВТ)) КАК Расч
	|СГРУППИРОВАТЬ ПО Расч.Контрагент
	|;
	|ВЫБРАТЬ КИ.Объект КАК Контрагент, МАКСИМУМ(ВЫРАЗИТЬ(КИ.Представление КАК СТРОКА(500))) КАК Адрес ПОМЕСТИТЬ ВТ_Адреса
	|ИЗ РегистрСведений.КонтактнаяИнформация КАК КИ
	|ГДЕ КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КИ.Объект В (ВЫБРАТЬ ВТ.Контрагент ИЗ ВТ_Контр КАК ВТ)
	|СГРУППИРОВАТЬ ПО КИ.Объект
	|;
	|ВЫБРАТЬ КИ.Объект КАК Контрагент, МАКСИМУМ(ВЫРАЗИТЬ(КИ.Представление КАК СТРОКА(100))) КАК Телефон ПОМЕСТИТЬ ВТ_Телефоны
	|ИЗ РегистрСведений.КонтактнаяИнформация КАК КИ
	|ГДЕ КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КИ.Объект В (ВЫБРАТЬ ВТ.Контрагент ИЗ ВТ_Контр КАК ВТ)
	|СГРУППИРОВАТЬ ПО КИ.Объект
	|;
	|ВЫБРАТЬ
	|	ВТ.Контрагент КАК Ссылка,
	|	ВТ.Контрагент.Наименование КАК Наименование,
	|	ВТ.Контрагент.Код КАК Код,
	|	ВТ.Контрагент.ОсновноеКонтактноеЛицо КАК КонтЛицо,
	|	ЕСТЬNULL(Адреса.Адрес, "") КАК Адрес,
	|	ЕСТЬNULL(Телефоны.Телефон, "") КАК Телефон,
	|	ЕСТЬNULL(Долги.Долг, 0) КАК Долг
	|ИЗ
	|	ВТ_Контр КАК ВТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Долги КАК Долги ПО Долги.Контрагент = ВТ.Контрагент
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Адреса КАК Адреса ПО Адреса.Контрагент = ВТ.Контрагент
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Телефоны КАК Телефоны ПО Телефоны.Контрагент = ВТ.Контрагент";

	Результат = Новый Массив;
	СтруктураПоСсылке = Новый Соответствие; // Ссылка контрагента -> його структура (для добивання контактів)
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Контрагент = Новый Структура;
		Контрагент.Вставить("id", ИдСсылки(Выборка.Ссылка));
		Контрагент.Вставить("name", Выборка.Наименование);
		Контрагент.Вставить("code", Выборка.Код);
		Контрагент.Вставить("address", Выборка.Адрес); // адреса з регістру КонтактнаяИнформация
		Контрагент.Вставить("contact", Строка(Выборка.КонтЛицо)); // основна контактна особа
		Контрагент.Вставить("phone", Выборка.Телефон);
		Контрагент.Вставить("debt", Выборка.Долг);
		Результат.Добавить(Контрагент);
		СтруктураПоСсылке.Вставить(Выборка.Ссылка, Контрагент);
	КонецЦикла;

	// Кілька контактних осіб (#11) — масив contacts у відповідних контрагентів.
	ЗаполнитьКонтактныеЛица(МВТ, СтруктураПоСсылке);

	Возврат Результат;
КонецФункции

// Додає масив "contacts" ([{name, phone}, …]) кожному контрагенту з контактними
// особами (Справочник.КонтактныеЛицаКонтрагентов). Телефони — з регістру
// КонтактнаяИнформация за контактною особою. Використовує ВТ_Контр зі спільного МВТ.
Процедура ЗаполнитьКонтактныеЛица(МВТ, СтруктураПоСсылке)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст =
	"ВЫБРАТЬ КЛ.Ссылка КАК Лицо, КЛ.Владелец КАК Контрагент, КЛ.Наименование КАК Имя
	|ПОМЕСТИТЬ ВТ_КЛ
	|ИЗ Справочник.КонтактныеЛицаКонтрагентов КАК КЛ
	|ГДЕ КЛ.Владелец В (ВЫБРАТЬ ВТ.Контрагент ИЗ ВТ_Контр КАК ВТ) И НЕ КЛ.ПометкаУдаления
	|;
	|ВЫБРАТЬ КИ.Объект КАК Лицо, МАКСИМУМ(ВЫРАЗИТЬ(КИ.Представление КАК СТРОКА(100))) КАК Телефон
	|ПОМЕСТИТЬ ВТ_ТелЛиц
	|ИЗ РегистрСведений.КонтактнаяИнформация КАК КИ
	|ГДЕ КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КИ.Объект В (ВЫБРАТЬ ВТ.Лицо ИЗ ВТ_КЛ КАК ВТ)
	|СГРУППИРОВАТЬ ПО КИ.Объект
	|;
	|ВЫБРАТЬ
	|	Л.Контрагент КАК Контрагент,
	|	Л.Имя КАК Имя,
	|	ЕСТЬNULL(Т.Телефон, "") КАК Телефон
	|ИЗ ВТ_КЛ КАК Л
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТелЛиц КАК Т ПО Т.Лицо = Л.Лицо
	|УПОРЯДОЧИТЬ ПО Л.Контрагент, Л.Имя";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Структура = СтруктураПоСсылке.Получить(Выборка.Контрагент);
		Если Структура = Неопределено Тогда Продолжить; КонецЕсли;
		Если Не Структура.Свойство("contacts") Тогда
			Структура.Вставить("contacts", Новый Массив);
		КонецЕсли;
		Лицо = Новый Структура("name, phone", Строка(Выборка.Имя), Выборка.Телефон);
		Структура.contacts.Добавить(Лицо);
	КонецЦикла;
КонецПроцедуры

Функция ЗаказыУстройства(Устройство, НачалоПериода, КонецПериода)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Менеджер", Устройство.Менеджер);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДатыИзСтроки(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДатыИзСтроки(КонецПериода));
	Запрос.Текст =
	"ВЫБРАТЬ Заказ.Ссылка КАК Ссылка
	|ИЗ Документ.ЗаказПокупателя КАК Заказ
	|ГДЕ Заказ.Ответственный = &Менеджер
	|	И (&НачалоПериода = ДАТАВРЕМЯ(1,1,1) ИЛИ Заказ.Дата >= &НачалоПериода)
	|	И (&КонецПериода = ДАТАВРЕМЯ(1,1,1) ИЛИ Заказ.Дата <= &КонецПериода)
	|УПОРЯДОЧИТЬ ПО Заказ.Дата УБЫВ";

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(ГидратироватьЗаказ(Выборка.Ссылка));
	КонецЦикла;
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Заказы

Функция ГидратироватьЗаказ(СсылкаЗаказа)
	Заказ = СсылкаЗаказа.ПолучитьОбъект();

	Контрагент = Новый Структура;
	Контрагент.Вставить("id", ИдСсылки(Заказ.Контрагент));
	Контрагент.Вставить("name", Строка(Заказ.Контрагент));
	Контрагент.Вставить("code", Заказ.Контрагент.Код);
	Контрагент.Вставить("address", ""); // адреса — у регістрі КонтактнаяИнформация (ROADMAP #35)

	Позиции = Новый Массив;
	Сумма = 0;
	Для Каждого СтрокаТовара Из Заказ.Товары Цикл
		Товар = Новый Структура;
		Товар.Вставить("id", ИдСсылки(СтрокаТовара.Номенклатура));
		Товар.Вставить("name", Строка(СтрокаТовара.Номенклатура));
		Товар.Вставить("sku", СтрокаТовара.Номенклатура.Артикул);
		Товар.Вставить("price", СтрокаТовара.Цена);
		Товар.Вставить("unit", Строка(СтрокаТовара.ЕдиницаИзмерения));
		Товар.Вставить("img", "");

		Позиция = Новый Структура("product, qty", Товар, СтрокаТовара.Количество);
		Позиции.Добавить(Позиция);
		Сумма = Сумма + СтрокаТовара.Цена * СтрокаТовара.Количество;
	КонецЦикла;

	// Статуси клієнта: помічений на видалення → "Видалено"; проведений у 1С → "Проведено"
	// (лише перегляд); непроведений, але вже в базі → "Відправлено". "Нове" в 1С немає
	// (це лише локальне невідправлене).
	Если Заказ.ПометкаУдаления Тогда
		Статус = "Видалено";
	Иначе
		Статус = ?(Заказ.Проведен, "Проведено", "Відправлено");
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("id", ИдСсылки(СсылкаЗаказа)); // GUID-ідентичність замовлення
	Результат.Вставить("num", Заказ.Номер);
	// Токен версії для оптимістичної конкуренції — типове поле ВерсияДанных (платформа
	// сама змінює його при кожному записі). Клієнт трактує як непрозорий рядок (рівність).
	Результат.Вставить("version", Строка(СсылкаЗаказа.ВерсияДанных));
	Результат.Вставить("customerId", ИдСсылки(Заказ.Контрагент));
	Результат.Вставить("client", Строка(Заказ.Контрагент));
	Результат.Вставить("customer", Контрагент);
	Результат.Вставить("date", Формат(Заказ.Дата, "ДФ=yyyy-MM-dd"));
	Результат.Вставить("status", Статус);
	Результат.Вставить("deletionMark", Заказ.ПометкаУдаления); // помітка на видалення
	// Колір статусу: видалене — червоне, проведене — сіре, відправлене — зелене.
	Результат.Вставить("sColor", ?(Заказ.ПометкаУдаления, "#C0392B", ?(Заказ.Проведен, "#8A8C96", "#4ECDA4")));
	Результат.Вставить("items", Позиции);
	Результат.Вставить("total", ФорматСуммы(Сумма));
	Возврат Результат;
КонецФункции

Функция СоздатьЗаказ(Устройство, Тело)
	Заказ = Документы.ЗаказПокупателя.СоздатьДокумент();
	// Присвоюємо документу посилання = клієнтський GUID (id), щоб ідентичність збігалася
	// з застосунком (routing/upsert за id). Якщо id некоректний/відсутній — звичайне нове.
	Ид = ?(ТипЗнч(Тело) = Тип("Соответствие"), Тело.Получить("id"), Неопределено);
	Если ЗначениеЗаполнено(Ид) Тогда
		Попытка
			НоваяСсылка = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка(Ид)));
			Заказ.УстановитьСсылкуНового(НоваяСсылка);
		Исключение
			// некоректний GUID — лишаємо автоматичне посилання
		КонецПопытки;
	КонецЕсли;
	Заказ.Дата = ДатаЗаказаИзТела(Тело); // дата з додатку (поле "date"), інакше поточна
	Заказ.Контрагент = СсылкаКонтрагента(Тело.Получить("customerId"));
	Заказ.Организация = ОрганизацияПоУмолчанию();            // TODO: вивірити на бойовій базі
	Заказ.ДоговорКонтрагента = ОсновнойДоговор(Заказ.Контрагент); // TODO: вивірити
	Заказ.ТипЦен = Устройство.ТипЦен;
	Заказ.СтруктурнаяЕдиница = Устройство.Склад;
	Заказ.Ответственный = Устройство.Менеджер;
	Заказ.СуммаВключаетНДС = Истина;
	Заказ.УчитыватьНДС = Истина;

	ЗаполнитьТовары(Заказ, Тело.Получить("orderItems"));
	ЗаписатьЗаказ(Заказ, Устройство, Тело.Получить("status"));
	Возврат Заказ.Ссылка;
КонецФункции

Процедура ОбновитьЗаказ(СсылкаЗаказа, Устройство, Тело)
	Заказ = СсылкаЗаказа.ПолучитьОбъект();
	Если Тело.Получить("customerId") <> Неопределено Тогда
		Заказ.Контрагент = СсылкаКонтрагента(Тело.Получить("customerId"));
	КонецЕсли;
	// Дату міняємо лише якщо передана й коректна (інакше лишаємо наявну).
	Если Тело.Получить("date") <> Неопределено Тогда
		ДатаТела = ДатаИзISO(Строка(Тело.Получить("date")));
		Если ДатаТела <> '00010101' Тогда Заказ.Дата = ДатаТела; КонецЕсли;
	КонецЕсли;
	Если Тело.Получить("orderItems") <> Неопределено Тогда
		ЗаполнитьТовары(Заказ, Тело.Получить("orderItems"));
	КонецЕсли;
	// Зняття помітки на видалення (команда "Зняти помітку видалення").
	Если Тело.Получить("deletionMark") = Ложь Тогда
		Заказ.ПометкаУдаления = Ложь;
	КонецЕсли;
	ЗаписатьЗаказ(Заказ, Устройство, Тело.Получить("status"));
КонецПроцедуры

// Записати замовлення: якщо потрібно проводити (налаштування пристрою або явний статус
// "Проведено") — Записать(Проведение) з рухами, інакше — Записать(Запись), документ
// лишається непроведеним ("Відправлено"). Запис і проведення — в одній транзакції: якщо
// проведення не проходить (контроль залишків тощо), документ не зберігається й помилка
// повертається клієнту.
Процедура ЗаписатьЗаказ(Заказ, Устройство, Статус)
	Если НужноПровести(Устройство, Статус) Тогда
		Заказ.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		Заказ.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
КонецПроцедуры

// Чи проводити документ. Проведення налаштовується ДЛЯ КОЖНОГО ПРИСТРОЮ (реквізит
// АвтоПроведение): якщо увімкнено — синхронізовані замовлення одразу проводяться.
// Незалежно від налаштування, явний статус "Проведено" в тілі запиту також проводить.
Функция НужноПровести(Устройство, Статус)
	Если Устройство <> Неопределено И Устройство.АвтоПроведение Тогда
		Возврат Истина;
	КонецЕсли;
	Если Статус = Неопределено Тогда Возврат Ложь; КонецЕсли;
	СтатусСтр = НРег(СокрЛП(Строка(Статус)));
	Возврат СтатусСтр = НРег("Проведено") ИЛИ СтатусСтр = "posted";
КонецФункции

Процедура ЗаполнитьТовары(Заказ, ПозицииМассив)
	Заказ.Товары.Очистить();
	Если ТипЗнч(ПозицииМассив) <> Тип("Массив") Тогда Возврат; КонецЕсли;

	Для Каждого Поз Из ПозицииМассив Цикл
		Номенклатура = СсылкаНоменклатуры(ЗначениеИзПозиции(Поз, "productId"));
		Если Номенклатура = Неопределено Тогда Продолжить; КонецЕсли;

		Строка = Заказ.Товары.Добавить();
		Строка.Номенклатура = Номенклатура;
		Строка.Количество = Число(ЗначениеИзПозиции(Поз, "qty"));
		Строка.Цена = Число(ЗначениеИзПозиции(Поз, "price")); // зафіксована ціна з пристрою
		Строка.Сумма = Строка.Количество * Строка.Цена;
		Строка.ЕдиницаИзмерения = Номенклатура.БазоваяЕдиницаИзмерения;
		Строка.Коэффициент = 1;
	КонецЦикла;
КонецПроцедуры

Функция НайтиЗаказПоНомеру(Номер)
	Если ПустаяСтрока(Номер) Тогда Возврат Неопределено; КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Документ.ЗаказПокупателя ГДЕ Номер = &Номер УПОРЯДОЧИТЬ ПО Дата УБЫВ");
	Запрос.УстановитьПараметр("Номер", Номер);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
КонецФункции

// Замовлення за GUID-ідентифікатором (= УникальныйИдентификатор посилання документа).
// Клієнтський GUID локального замовлення стає посиланням документа (див. СоздатьЗаказ),
// тож routing і upsert працюють за тим самим id. Перевіряємо реальне існування в БД.
Функция НайтиЗаказПоИд(Ид)
	Если ПустаяСтрока(Ид) Тогда Возврат Неопределено; КонецЕсли;
	Попытка
		Ссылка = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка(Ид)));
	Исключение
		Возврат Неопределено; // некоректний GUID
	КонецПопытки;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Документ.ЗаказПокупателя ГДЕ Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Возврат ?(Запрос.Выполнить().Пустой(), Неопределено, Ссылка);
КонецФункции

#КонецОбласти

#Область Вспомогательные

// Ідентифікатор посилання в API = рядковий GUID (УникальныйИдентификатор).
Функция ИдСсылки(Ссылка)
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда Возврат ""; КонецЕсли;
	Возврат Строка(Ссылка.УникальныйИдентификатор());
КонецФункции

Функция СсылкаКонтрагента(Ид)
	Возврат СсылкаПоИд(Справочники.Контрагенты, Ид);
КонецФункции

Функция СсылкаНоменклатуры(Ид)
	Возврат СсылкаПоИд(Справочники.Номенклатура, Ид);
КонецФункции

Функция СсылкаПоИд(МенеджерСправочника, Ид)
	Если ПустаяСтрока(Ид) Тогда Возврат Неопределено; КонецЕсли;
	Попытка
		Ссылка = МенеджерСправочника.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка(Ид)));
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	Возврат ?(ЗначениеЗаполнено(Ссылка), Ссылка, Неопределено);
КонецФункции

Функция ЗначениеИзПозиции(Поз, Ключ)
	Если ТипЗнч(Поз) = Тип("Соответствие") Тогда
		Возврат Поз.Получить(Ключ);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ОрганизацияПоУмолчанию()
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.Организации ГДЕ НЕ ПометкаУдаления И НЕ ЭтоГруппа");
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Справочники.Организации.ПустаяСсылка());
КонецФункции

Функция ОсновнойДоговор(Контрагент)
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда Возврат Неопределено; КонецЕсли;
	Попытка
		Возврат Контрагент.ОсновнойДоговорВзаиморасчетов;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция НачалоДатыИзСтроки(Строка)
	Дата = ДатаИзISO(Строка);
	Возврат ?(Дата = '00010101', '00010101', НачалоДня(Дата));
КонецФункции

Функция КонецДатыИзСтроки(Строка)
	Дата = ДатаИзISO(Строка);
	Возврат ?(Дата = '00010101', '00010101', КонецДня(Дата));
КонецФункции

// Дата замовлення з тіла запиту (поле "date", формат YYYY-MM-DD); якщо немає
// чи некоректна — поточна дата.
Функция ДатаЗаказаИзТела(Тело)
	Значение = ?(ТипЗнч(Тело) = Тип("Соответствие"), Тело.Получить("date"), Неопределено);
	Если Значение <> Неопределено Тогда
		Дата = ДатаИзISO(Строка(Значение));
		Если Дата <> '00010101' Тогда Возврат Дата; КонецЕсли;
	КонецЕсли;
	Возврат ТекущаяДата();
КонецФункции

Функция ДатаИзISO(Строка)
	Если ПустаяСтрока(Строка) Тогда Возврат '00010101'; КонецЕсли;
	Попытка
		Возврат Дата(Число(Лев(Строка, 4)), Число(Сред(Строка, 6, 2)), Число(Сред(Строка, 9, 2)));
	Исключение
		Возврат '00010101';
	КонецПопытки;
КонецФункции

// "1 078.00 ₴" — пробіл як роздільник тисяч, крапка — десятковий (як очікує фронтенд).
Функция ФорматСуммы(Сумма)
	Возврат Формат(Сумма, "ЧДЦ=2; ЧРД=.; ЧРГ=' '; ЧГ=3") + " ₴";
КонецФункции

#КонецОбласти

#Область HTTP

Функция ПрочитатьТелоJSON(Запрос)
	ТелоСтрока = Запрос.ПолучитьТелоКакСтроку();
	Если ПустаяСтрока(ТелоСтрока) Тогда Возврат Неопределено; КонецЕсли;
	Попытка
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(ТелоСтрока);
		// ВозвращатьСоответствие=Истина: обробники очікують Соответствие (.Получить),
		// а за замовчуванням ПрочитатьJSON повертає Структуру — тоді тіло не читалося.
		Данные = ПрочитатьJSON(Чтение, Истина);
		Чтение.Закрыть();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	Возврат Данные;
КонецФункции

Функция ОтветJSON(Данные, КодСостояния = 200)
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Данные);
	ТелоСтрока = Запись.Закрыть();

	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.УстановитьТелоИзСтроки(ТелоСтрока, КодировкаТекста.UTF8);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", "*");
	Возврат Ответ;
КонецФункции

// Централізована обробка рантайм-помилки обробника: пише конкретний опис у журнал
// реєстрації (подія "венд_МобильноеПриложение") і повертає 500 із цим же текстом, а не
// загальним "збоєм". ОписаниеОшибки()/ЗаписьЖурналаРегистрации доступні в режимі 8.2.13.
// УВАГА: це ловить лише РАНТАЙМ-помилки. Помилки КОМПІЛЯЦІЇ ("Помилка ініціалізації
// модуля") сюди не потрапляють — їх шукати синтаксичним контролем у Конфігураторі.
Функция ОтветИсключение(Запрос, ТекстОшибки)
	ЗаписьЖурналаРегистрации("венд_МобильноеПриложение",
		УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	Возврат ОтветJSON(Новый Структура("success, message", Ложь, ТекстОшибки), 500);
КонецФункции

// Відповідь без тіла (для бінарних ендпоінтів: 404 тощо).
Функция ОтветБезТела(КодСостояния)
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", "*");
	Возврат Ответ;
КонецФункции

// MIME-тип за форматом об'єкта Картинка (основний шлях — у ХранилищеДополнительнойИнформации
// зображення лежить як Картинка, а ИмяФайла порожнє).
Функция MIMEПоФорматуКартинки(Формат)
	Если Формат = ФорматКартинки.PNG Тогда
		Возврат "image/png";
	ИначеЕсли Формат = ФорматКартинки.JPG Тогда
		Возврат "image/jpeg";
	ИначеЕсли Формат = ФорматКартинки.GIF Тогда
		Возврат "image/gif";
	ИначеЕсли Формат = ФорматКартинки.BMP Тогда
		Возврат "image/bmp";
	ИначеЕсли Формат = ФорматКартинки.TIFF Тогда
		Возврат "image/tiff";
	КонецЕсли;
	Возврат "application/octet-stream";
КонецФункции

// MIME-тип за розширенням імені файлу (для зображень номенклатури).
// Розширення дістаємо вручну (СтрРазделить недоступна в режимі сумісності 8.2.13).
Функция MIMEПоИмениФайла(ИмяФайла)
	Расш = "";
	Поз = СтрДлина(ИмяФайла);
	Пока Поз > 0 Цикл
		Если Сред(ИмяФайла, Поз, 1) = "." Тогда
			Расш = НРег(Сред(ИмяФайла, Поз + 1));
			Прервать;
		КонецЕсли;
		Поз = Поз - 1;
	КонецЦикла;
	Таблица = Новый Соответствие;
	Таблица.Вставить("png", "image/png");
	Таблица.Вставить("jpg", "image/jpeg");
	Таблица.Вставить("jpeg", "image/jpeg");
	Таблица.Вставить("gif", "image/gif");
	Таблица.Вставить("webp", "image/webp");
	Таблица.Вставить("bmp", "image/bmp");
	МИМЕ = Таблица.Получить(Расш);
	Возврат ?(МИМЕ = Неопределено, "application/octet-stream", МИМЕ);
КонецФункции

// Відповідь 401 з розрізненням: заголовок X-Device-Id відсутній (не визначено)
// vs переданий, але пристрій не знайдено (не зареєстровано).
Функция ОтветНеАвторизован(Запрос)
	Если ПустаяСтрока(ИдентификаторУстройстваИзЗапроса(Запрос)) Тогда
		Сообщ = НСтр("uk='Пристрій не визначено (X-Device-Id)'; ru='Устройство не определено (X-Device-Id)'; en='Device is not identified (X-Device-Id)'",
			КодЯзыкаЗапроса(Запрос));
	Иначе
		Сообщ = НСтр("uk='Пристрій не зареєстровано'; ru='Устройство не зарегистрировано'; en='Device is not registered'",
			КодЯзыкаЗапроса(Запрос));
	КонецЕсли;
	Возврат ОтветJSON(Новый Структура("success, message", Ложь, Сообщ), 401);
КонецФункции

// Код мови запиту (uk/ru/en) із заголовка Accept-Language або параметра ?lang.
// Якщо мову не розпізнано — англійська як запасна (issue #26).
Функция КодЯзыкаЗапроса(Запрос)
	Значение = Запрос.Заголовки.Получить("Accept-Language");
	Если Значение = Неопределено Тогда
		Значение = Запрос.ПараметрыЗапроса.Получить("lang");
	КонецЕсли;
	Если Значение = Неопределено Тогда Возврат "en"; КонецЕсли;
	Лев2 = НРег(Лев(СокрЛП(Строка(Значение)), 2));
	Если Лев2 = "uk" ИЛИ Лев2 = "ua" Тогда
		Возврат "uk";
	ИначеЕсли Лев2 = "ru" Тогда
		Возврат "ru";
	КонецЕсли;
	Возврат "en";
КонецФункции

#КонецОбласти
